{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "a156da49",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: SPARQLWrapper in /Users/seogwang-won/opt/anaconda3/lib/python3.9/site-packages (1.8.4)\r\n",
      "Requirement already satisfied: rdflib>=4.0 in /Users/seogwang-won/opt/anaconda3/lib/python3.9/site-packages (from SPARQLWrapper) (5.0.0)\r\n",
      "Requirement already satisfied: pyparsing in /Users/seogwang-won/opt/anaconda3/lib/python3.9/site-packages (from rdflib>=4.0->SPARQLWrapper) (3.0.4)\r\n",
      "Requirement already satisfied: isodate in /Users/seogwang-won/opt/anaconda3/lib/python3.9/site-packages (from rdflib>=4.0->SPARQLWrapper) (0.6.1)\r\n",
      "Requirement already satisfied: six in /Users/seogwang-won/opt/anaconda3/lib/python3.9/site-packages (from rdflib>=4.0->SPARQLWrapper) (1.16.0)\r\n"
     ]
    }
   ],
   "source": [
    "!pip install SPARQLWrapper"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "b7a59f21",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Subject: http://kbpedia.org/kko/rc/WestVirginiaCulture, Predicate: http://www.w3.org/1999/02/22-rdf-syntax-ns#type, Object: http://www.w3.org/2002/07/owl#Class\n",
      "Subject: http://kbpedia.org/kko/rc/WestVirginiaCulture, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/AmericanCulture\n",
      "Subject: http://kbpedia.org/kko/rc/AmericanCulture, Predicate: http://www.w3.org/1999/02/22-rdf-syntax-ns#type, Object: http://www.w3.org/2002/07/owl#Class\n",
      "Subject: http://kbpedia.org/kko/rc/AmericanCulture, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/NationalCulture\n",
      "Subject: http://kbpedia.org/kko/rc/Vrata, Predicate: http://www.w3.org/1999/02/22-rdf-syntax-ns#type, Object: http://www.w3.org/2002/07/owl#Class\n",
      "Subject: http://kbpedia.org/kko/rc/Vrata, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/ReligiousBeliefAndDoctrine\n",
      "Subject: http://kbpedia.org/kko/rc/ReligiousBeliefAndDoctrine, Predicate: http://www.w3.org/1999/02/22-rdf-syntax-ns#type, Object: http://www.w3.org/2002/07/owl#Class\n",
      "Subject: http://kbpedia.org/kko/rc/ReligiousBeliefAndDoctrine, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/BeliefSystemType\n",
      "Subject: http://kbpedia.org/kko/rc/Adware, Predicate: http://www.w3.org/1999/02/22-rdf-syntax-ns#type, Object: http://www.w3.org/2002/07/owl#Class\n",
      "Subject: http://kbpedia.org/kko/rc/Adware, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/Advertising\n",
      "Subject: http://kbpedia.org/kko/rc/Advertising, Predicate: http://www.w3.org/1999/02/22-rdf-syntax-ns#type, Object: http://www.w3.org/2002/07/owl#Class\n",
      "Subject: http://kbpedia.org/kko/rc/Advertising, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/MarketingActivity\n",
      "Subject: http://kbpedia.org/kko/rc/MycenaeanGreekLanguage, Predicate: http://www.w3.org/1999/02/22-rdf-syntax-ns#type, Object: http://www.w3.org/2002/07/owl#Class\n",
      "Subject: http://kbpedia.org/kko/rc/MycenaeanGreekLanguage, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/ModernGreekLanguage\n",
      "Subject: http://kbpedia.org/kko/rc/ModernGreekLanguage, Predicate: http://www.w3.org/1999/02/22-rdf-syntax-ns#type, Object: http://www.w3.org/2002/07/owl#Class\n",
      "Subject: http://kbpedia.org/kko/rc/ModernGreekLanguage, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/LivingLanguage\n",
      "Subject: http://kbpedia.org/kko/rc/ModernGreekLanguage, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/Indo-EuropeanLanguageFamily\n",
      "Subject: http://kbpedia.org/kko/rc/NootkaLanguage, Predicate: http://www.w3.org/1999/02/22-rdf-syntax-ns#type, Object: http://www.w3.org/2002/07/owl#Class\n",
      "Subject: http://kbpedia.org/kko/rc/NootkaLanguage, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/LivingLanguage\n",
      "Subject: http://kbpedia.org/kko/rc/LivingLanguage, Predicate: http://www.w3.org/1999/02/22-rdf-syntax-ns#type, Object: http://www.w3.org/2002/07/owl#Class\n",
      "Subject: http://kbpedia.org/kko/rc/LivingLanguage, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/NaturalLanguage\n",
      "Subject: http://kbpedia.org/kko/rc/EvangelicalAnglicanism, Predicate: http://www.w3.org/1999/02/22-rdf-syntax-ns#type, Object: http://www.w3.org/2002/07/owl#Class\n",
      "Subject: http://kbpedia.org/kko/rc/EvangelicalAnglicanism, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/EvangelicalChristianity\n",
      "Subject: http://kbpedia.org/kko/rc/EvangelicalChristianity, Predicate: http://www.w3.org/1999/02/22-rdf-syntax-ns#type, Object: http://www.w3.org/2002/07/owl#Class\n",
      "Subject: http://kbpedia.org/kko/rc/EvangelicalChristianity, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/MonotheisticReligion\n"
     ]
    }
   ],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "# Set the SPARQL endpoint URL\n",
    "sparql_endpoint_society = \"http://localhost:3030/society/sparql\"\n",
    "\n",
    "# Create a SPARQLWrapper instance\n",
    "sparql_society = SPARQLWrapper(sparql_endpoint_society)\n",
    "\n",
    "# Set the SPARQL query\n",
    "sparql_society.setQuery(\"\"\"\n",
    "    SELECT ?subject ?predicate ?object\n",
    "    WHERE {\n",
    "      ?subject ?predicate ?object\n",
    "    }\n",
    "    LIMIT 25\n",
    "\"\"\")\n",
    "\n",
    "# Specify the format of the results (JSON in this case)\n",
    "sparql_society.setReturnFormat(JSON)\n",
    "\n",
    "# Execute the query and get the results\n",
    "results = sparql_society.query().convert()\n",
    "\n",
    "# Print the results\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    subject = result[\"subject\"][\"value\"]\n",
    "    predicate = result[\"predicate\"][\"value\"]\n",
    "    obj = result[\"object\"][\"value\"]\n",
    "    print(f\"Subject: {subject}, Predicate: {predicate}, Object: {obj}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "4d98c52b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "ModernGreekLanguage\n",
      "NootkaLanguage\n",
      "MarshalleseLanguage\n",
      "WelshLanguage\n",
      "IcelandicLanguage\n",
      "ShillukLanguage\n",
      "EgyptianArabicLanguage\n",
      "SwahiliLanguage\n",
      "NandiLanguage\n",
      "KhasiLanguage\n",
      "CocopaLanguage\n",
      "EnglishLanguage\n",
      "BengaliLanguage\n",
      "LoyaltyIslandsLanguage\n",
      "UkrainianLanguage\n",
      "RomanianLanguage\n",
      "ManchuLanguage\n",
      "ComoranLanguage\n",
      "CherokeeLanguage\n",
      "FijianLanguage\n",
      "MiamiLanguage\n",
      "KikuyuLanguage\n",
      "MalayalamLanguage\n",
      "KongoLanguage\n",
      "TillamookLanguage\n",
      "CaribLanguage\n",
      "SamoanLanguage\n",
      "ApacheLanguage\n",
      "ComancheLanguage\n",
      "BulgarianLanguage\n",
      "MixtecoLanguage\n",
      "MasalitLanguage\n",
      "OneidaLanguage\n",
      "SpanishLanguage\n",
      "GermanLanguage\n",
      "EstonianLanguage\n",
      "SokoroLanguage\n",
      "HopiLanguage\n",
      "FinnishLanguage\n",
      "ItalianLanguage\n",
      "KalangaLanguage\n",
      "ChamLanguage\n",
      "OstyakLanguage\n",
      "HottentotLanguage\n",
      "DutchLanguage\n",
      "MangbetuLanguage\n",
      "CaddoLanguage\n",
      "NupeLanguage\n",
      "CriouloLanguage\n",
      "FrenchCreoleLanguage\n",
      "IboLanguage\n",
      "MicmacLanguage\n",
      "ClassicalArabicWriting\n",
      "GagauzLanguage\n",
      "KachinLanguage\n",
      "GeorgianLanguage\n",
      "KarenLanguage\n",
      "LuoLanguage\n",
      "KanareseLanguage\n",
      "RussianLanguage\n",
      "ManxLanguage\n",
      "SeriLanguage\n",
      "SererLanguage\n",
      "OtuhoLanguage\n",
      "MadureseLanguage\n",
      "KaffaLanguage\n",
      "BiniLanguage\n",
      "OnondagaLanguage\n",
      "TumtumLanguage\n",
      "ChoctawLanguage\n",
      "MalayLanguage\n",
      "PlattdeutschLanguage\n",
      "ArmenianLanguage\n",
      "XiangLanguage\n",
      "TurkishLanguage\n",
      "SangoLanguage\n",
      "KirghizLanguage\n",
      "UrduLanguage\n",
      "LugandaLanguage\n",
      "BurmeseLanguage\n",
      "FriulianDialect\n",
      "KoryakLanguage\n",
      "ChaouiaLanguage\n",
      "EweLanguage\n",
      "BislamaLanguage\n",
      "HausaLanguage\n",
      "PortugueseLanguage\n",
      "OttawaLanguage\n",
      "ZaghawaLanguage\n",
      "ShuswapLanguage\n",
      "TonganLanguage\n",
      "PennsylvaniaGermanLanguage\n",
      "MaloLanguage\n",
      "BikolLanguage\n",
      "KhmuLanguage\n",
      "TiwaLanguage\n",
      "GanzaLanguage\n",
      "YaruroLanguage\n",
      "IndonesianLanguage\n",
      "TarahumareLanguage\n",
      "GuaraniLanguage\n",
      "KalenjinLanguage\n",
      "CatalanLanguage\n",
      "ZandeLanguage\n",
      "MakuaLanguage\n",
      "TedaLanguage\n",
      "EgyptianArabic\n",
      "SolomonIslandsPidginLanguage\n",
      "LithuanianLanguage\n",
      "HungarianLanguage\n",
      "KunamaLanguage\n",
      "PicuncheLanguage\n",
      "IrishLanguage\n",
      "CzechLanguage\n",
      "ZuluLanguage\n",
      "SerboCroatianLanguage\n",
      "KomaLanguage\n",
      "FlemishLanguage\n",
      "KonkaniDialect\n",
      "OromoLanguage\n",
      "SpokanLanguage\n",
      "SomaliLanguage\n",
      "IllinoisLanguage\n",
      "NungLanguage\n",
      "TotonacLanguage\n",
      "DayakLanguage\n",
      "PolishLanguage\n",
      "EfikLanguage\n",
      "ColvilleLanguage\n",
      "YumaLanguage\n",
      "MalagasyLanguage\n",
      "LusatianLanguage\n",
      "MaayLanguage\n",
      "CofanLanguage\n",
      "KabyleLanguage\n",
      "TatarLanguage\n",
      "RiffLanguage\n",
      "BokmalDialect\n",
      "OldEnglishLanguage\n",
      "WolayttaLanguage\n",
      "WolofLanguage\n",
      "SiswatiLanguage\n",
      "ClallamLanguage\n",
      "MeitheiLanguage\n",
      "NoghayLanguage\n",
      "NitinatLanguage\n",
      "CantoneseLanguage\n",
      "AssiniboinLanguage\n",
      "YavapaiLanguage\n",
      "AgauLanguage\n",
      "HaitianCreoleLanguage\n",
      "ModocLanguage\n",
      "MaoriLanguage\n",
      "AshantiLanguage\n",
      "KamiaLanguage\n",
      "BlackfootLanguage\n",
      "DagombaLanguage\n",
      "ChechenLanguage\n",
      "HoopaLanguage\n",
      "NauruanLanguage\n",
      "MossiLanguage\n",
      "PenobscotLanguage\n",
      "MuongLanguage\n",
      "FuegianLanguage\n",
      "JamaicanCreoleLanguage\n",
      "BellaCoolaLanguage\n",
      "KazakhLanguage\n",
      "HindiLanguage\n",
      "SwedishLanguage\n",
      "AkanLanguage\n",
      "AlemannicDialect\n",
      "SaxonLanguage\n",
      "ScottishGaelicLanguage\n",
      "SindebeleLanguage\n",
      "PangasinanLanguage\n",
      "HuastecLanguage\n",
      "GaroLanguage\n",
      "CreeLanguage\n",
      "SiwiLanguage\n",
      "Chasta-CostaLanguage\n",
      "BelorussianLanguage\n",
      "Komi-PermyakLanguage\n",
      "CheyenneLanguage\n",
      "PampanganLanguage\n",
      "CayugaLanguage\n",
      "Waray-WarayLanguage\n",
      "GumuzLanguage\n",
      "BugiLanguage\n",
      "YiLanguage\n",
      "DazaLanguage\n",
      "TaiDamLanguage\n",
      "HadiyyaLanguage\n",
      "SacAndFoxLanguage\n",
      "TemneLanguage\n",
      "MacedonianLanguage\n",
      "YaquiLanguage\n",
      "SeychellesCreoleLanguage\n",
      "KhmerLanguage\n",
      "SiouxLanguage\n",
      "AguarunaLanguage\n",
      "TupiLanguage\n",
      "PunuLanguage\n",
      "HakkaLanguage\n",
      "KwakiutlLanguage\n",
      "BurjiLanguage\n",
      "NorwegianLanguage\n",
      "RonLanguage\n",
      "MohaveLanguage\n",
      "CastilianLanguage\n",
      "MahikanLanguage\n",
      "SlovakLanguage\n",
      "GalicianLanguage\n",
      "EfeLanguage\n",
      "MauritiusCreoleLanguage\n",
      "YiddishLanguage\n",
      "GolaLanguage\n",
      "DaicLanguageFamily\n",
      "KarelianLanguage\n",
      "FangLanguage\n",
      "TamazightLanguage\n",
      "ShonaLanguage\n",
      "PatwinLanguage\n",
      "LingalaLanguage\n",
      "BukusuLanguage\n",
      "TigrinyaLanguage\n",
      "XhosaLanguage\n",
      "BodoLanguage\n",
      "BantuLanguages\n",
      "TuluLanguage\n",
      "UzbekLanguage\n",
      "MidobiLanguage\n",
      "NisqualliLanguage\n",
      "KamchadalLanguage\n",
      "AdmiraltyIslandsLanguages\n",
      "TahitianLanguage\n",
      "HuillicheLanguage\n",
      "LatvianLanguage\n",
      "JukunLanguage\n",
      "SemangLanguage\n",
      "TivLanguage\n",
      "KinyarwandaLanguage\n",
      "HawaiianLanguage\n",
      "TegaliLanguage\n",
      "ChickasawLanguage\n",
      "TagalogLanguage\n",
      "ShanLanguage\n",
      "IbanagLanguage\n",
      "ZapotecoLanguage\n",
      "BororoLanguage\n",
      "HuicholLanguage\n",
      "JemezLanguage\n",
      "DanishLanguage\n",
      "AngasLanguage\n",
      "UteLanguage\n",
      "BalineseLanguage\n",
      "HijiLanguage\n",
      "AlsatianDialect\n",
      "DzongkhaLanguage\n",
      "MaricopaLanguage\n",
      "YorubaLanguage\n",
      "DelawareLanguage\n",
      "MaldivianLanguage\n",
      "UdukLanguage\n",
      "SidamoLanguage\n",
      "DakotaLanguage\n",
      "WinnebagoLanguage\n",
      "ZoqueLanguage\n",
      "MaoLanguage\n",
      "ChamorroLanguage\n",
      "MapucheLanguage\n",
      "QuicheLanguage\n",
      "KickapooLanguage\n",
      "SothoLanguage\n",
      "GreenlandicEskimoLanguage\n",
      "GbayaLanguage\n",
      "MicronesianLanguage\n",
      "Saho-AfarLanguage\n",
      "TuscaroraLanguage\n",
      "BuryatLanguage\n",
      "GilberteseLanguage\n",
      "WichitaLanguage\n",
      "DinkaLanguage\n",
      "WintuLanguage\n",
      "ThongaLanguage\n",
      "TuvaluanLanguage\n",
      "SantaliLanguage\n",
      "VisayanLanguage\n",
      "BatakLanguage\n",
      "FlatheadLanguage\n",
      "GimiraLanguage\n",
      "PipilLanguage\n",
      "GuleLanguage\n",
      "SandaweLanguage\n",
      "TuaregLanguage\n",
      "NarragansettLanguage\n",
      "IjoLanguage\n",
      "KanuriLanguage\n",
      "GusiiLanguage\n",
      "MonLanguage\n",
      "MayaLanguage\n",
      "KutchinLanguage\n",
      "LomweLanguage\n",
      "BandaLanguage\n",
      "SenecaLanguage\n",
      "TamachekLanguage\n",
      "KiowaLanguage\n",
      "MasaiLanguage\n",
      "SarakoleLanguage\n",
      "MabaLanguage\n",
      "SrananLanguage\n",
      "JavaneseLanguage\n",
      "TeluguLanguage\n",
      "TibetanLanguage\n",
      "AfrikaansLanguage\n",
      "KirundiLanguage\n",
      "BavarianDialect\n",
      "FaeroeseLanguage\n",
      "ArapahoLanguage\n",
      "TasmanianLanguage\n",
      "HoLanguage\n",
      "FukieneseLanguage\n",
      "MandinkaLanguage\n",
      "FrisianLanguage\n",
      "NuerLanguage\n",
      "MbereLanguage\n",
      "FurLanguage\n",
      "CarolinianLanguage\n",
      "SetswanaLanguage\n",
      "LuhyaLanguage\n",
      "SesothoLanguage\n",
      "BritishSignLanguage\n",
      "AmharicLanguage\n",
      "TurkanaLanguage\n",
      "SlovenianLanguage\n",
      "OjibwaLanguage\n",
      "KambaLanguage\n",
      "PuyallupLanguage\n",
      "MakahLanguage\n",
      "KonsoLanguage\n",
      "BellaBellaLanguage\n",
      "FulaniLanguage\n",
      "CaciboLanguage\n",
      "KeleLanguage\n",
      "ArikaraLanguage\n",
      "AleutLanguage\n",
      "CrowLanguage\n",
      "OtomiLanguage\n",
      "IlocanoLanguage\n",
      "TachelhitLanguage\n",
      "BertaLanguage\n",
      "BeteLanguage\n",
      "PoliceMotuLanguage\n",
      "HiligaynonLanguage\n",
      "CatawbaLanguage\n",
      "YurokLanguage\n",
      "ShoshoneLanguage\n",
      "CajunLanguage\n",
      "SukLanguage\n",
      "NicobareseLanguage\n",
      "LimbuLanguage\n",
      "MagarLanguage\n",
      "PequotLanguage\n",
      "MendeLanguage\n",
      "ArakaneseLanguage\n",
      "KissiLanguage\n",
      "BembaLanguage\n",
      "MoheganLanguage\n",
      "KambaataLanguage\n",
      "HidatsaLanguage\n",
      "CarrierLanguage\n",
      "ShastaLanguage\n",
      "ChipewyanLanguage\n",
      "NomlakiLanguage\n",
      "PaltaLanguage\n",
      "ZuniLanguage\n",
      "TalodiLanguage\n",
      "WuLanguage\n",
      "KitamatLanguage\n",
      "LezgiLanguage\n",
      "PawneeLanguage\n",
      "AymaraLanguage\n",
      "ShawneeLanguage\n",
      "JivaroLanguage\n",
      "AbkhazLanguage\n",
      "KatlaLanguage\n",
      "TaiwaneseChineseLanguage\n",
      "TamangLanguage\n",
      "KashubianLanguage\n",
      "AmericanSignLanguage\n",
      "MbunduLanguage\n",
      "CreekLanguage\n",
      "NobiinLanguage\n",
      "WashoLanguage\n",
      "MandarinChineseLanguage\n",
      "SwabianDialect\n",
      "TigreLanguage\n",
      "HatsaLanguage\n",
      "NezPerceLanguage\n",
      "LuxembourgianLanguage\n",
      "DyulaLanguage\n",
      "MohawkLanguage\n",
      "MixeLanguage\n",
      "MarovoLanguage\n"
     ]
    }
   ],
   "source": [
    "# Question : Let me know all living languages.\n",
    "\n",
    "# Set the Query \n",
    "sparql_society.setQuery(\"\"\"\n",
    "    PREFIX kko: <http://kbpedia.org/kko/rc/>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    \n",
    "    SELECT ?languages\n",
    "    WHERE {\n",
    "      ?languages rdfs:subClassOf kko:LivingLanguage.\n",
    "}\n",
    "\"\"\")\n",
    "\n",
    "# Specify the format of the results (JSON in this case)\n",
    "sparql_society.setReturnFormat(JSON)\n",
    "\n",
    "# Execute the query and get the results\n",
    "results = sparql_society.query().convert()\n",
    "\n",
    "# Print the results\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    language = result[\"languages\"][\"value\"]\n",
    "    print(language[26:])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "c5d499e9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Subject: http://kbpedia.org/kko/rc/ContentsInsurance, Predicate: http://www.w3.org/1999/02/22-rdf-syntax-ns#type, Object: http://www.w3.org/2002/07/owl#Class\n",
      "Subject: http://kbpedia.org/kko/rc/ContentsInsurance, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/InsurancePlan\n",
      "Subject: http://kbpedia.org/kko/rc/InsurancePlan, Predicate: http://www.w3.org/1999/02/22-rdf-syntax-ns#type, Object: http://www.w3.org/2002/07/owl#Class\n",
      "Subject: http://kbpedia.org/kko/rc/InsurancePlan, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/AgreementForOngoingService\n",
      "Subject: http://kbpedia.org/kko/rc/BankCharge, Predicate: http://www.w3.org/1999/02/22-rdf-syntax-ns#type, Object: http://www.w3.org/2002/07/owl#Class\n",
      "Subject: http://kbpedia.org/kko/rc/BankCharge, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/PaymentObligation\n",
      "Subject: http://kbpedia.org/kko/rc/PaymentObligation, Predicate: http://www.w3.org/1999/02/22-rdf-syntax-ns#type, Object: http://www.w3.org/2002/07/owl#Class\n",
      "Subject: http://kbpedia.org/kko/rc/PaymentObligation, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/EconomicAgreement\n",
      "Subject: http://kbpedia.org/kko/rc/RamsarSite, Predicate: http://www.w3.org/1999/02/22-rdf-syntax-ns#type, Object: http://www.w3.org/2002/07/owl#Class\n",
      "Subject: http://kbpedia.org/kko/rc/RamsarSite, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/RamsarTreaty\n",
      "Subject: http://kbpedia.org/kko/rc/RamsarTreaty, Predicate: http://www.w3.org/1999/02/22-rdf-syntax-ns#type, Object: http://www.w3.org/2002/07/owl#Class\n",
      "Subject: http://kbpedia.org/kko/rc/RamsarTreaty, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/Treaty\n",
      "Subject: http://kbpedia.org/kko/rc/InventoryDocument, Predicate: http://www.w3.org/1999/02/22-rdf-syntax-ns#type, Object: http://www.w3.org/2002/07/owl#Class\n",
      "Subject: http://kbpedia.org/kko/rc/InventoryDocument, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/BusinessRelatedDocumentOrAgreement\n",
      "Subject: http://kbpedia.org/kko/rc/BusinessRelatedDocumentOrAgreement, Predicate: http://www.w3.org/1999/02/22-rdf-syntax-ns#type, Object: http://www.w3.org/2002/07/owl#Class\n",
      "Subject: http://kbpedia.org/kko/rc/BusinessRelatedDocumentOrAgreement, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/EconomicAgreement\n",
      "Subject: http://kbpedia.org/kko/rc/TransportationLicense-Document, Predicate: http://www.w3.org/1999/02/22-rdf-syntax-ns#type, Object: http://www.w3.org/2002/07/owl#Class\n",
      "Subject: http://kbpedia.org/kko/rc/TransportationLicense-Document, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/Permit\n",
      "Subject: http://kbpedia.org/kko/rc/Permit, Predicate: http://www.w3.org/1999/02/22-rdf-syntax-ns#type, Object: http://www.w3.org/2002/07/owl#Class\n",
      "Subject: http://kbpedia.org/kko/rc/Permit, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/Permission\n",
      "Subject: http://kbpedia.org/kko/rc/Permit, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/Contract\n",
      "Subject: http://kbpedia.org/kko/rc/Stock-Cum-Dividend, Predicate: http://www.w3.org/1999/02/22-rdf-syntax-ns#type, Object: http://www.w3.org/2002/07/owl#Class\n",
      "Subject: http://kbpedia.org/kko/rc/Stock-Cum-Dividend, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/Stock\n",
      "Subject: http://kbpedia.org/kko/rc/Stock, Predicate: http://www.w3.org/1999/02/22-rdf-syntax-ns#type, Object: http://www.w3.org/2002/07/owl#Class\n",
      "Subject: http://kbpedia.org/kko/rc/Stock, Predicate: http://www.w3.org/2000/01/rdf-schema#subClassOf, Object: http://kbpedia.org/kko/rc/Equity-Security\n"
     ]
    }
   ],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "# Set the SPARQL endpoint URL\n",
    "sparql_endpoint_ss = \"http://localhost:3030/SocialSystems/sparql\"\n",
    "\n",
    "# Create a SPARQLWrapper instance\n",
    "sparql_ss = SPARQLWrapper(sparql_endpoint_ss)\n",
    "\n",
    "# Set the SPARQL query\n",
    "sparql_ss.setQuery(\"\"\"\n",
    "    SELECT ?subject ?predicate ?object\n",
    "    WHERE {\n",
    "      ?subject ?predicate ?object\n",
    "    }\n",
    "    LIMIT 25\n",
    "\"\"\")\n",
    "\n",
    "# Specify the format of the results (JSON in this case)\n",
    "sparql_ss.setReturnFormat(JSON)\n",
    "\n",
    "# Execute the query and get the results\n",
    "results = sparql_ss.query().convert()\n",
    "\n",
    "# Print the results\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    subject = result[\"subject\"][\"value\"]\n",
    "    predicate = result[\"predicate\"][\"value\"]\n",
    "    obj = result[\"object\"][\"value\"]\n",
    "    print(f\"Subject: {subject}, Predicate: {predicate}, Object: {obj}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "f5143f70",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "EnergyPolicy\n",
      "HealthPolicy\n",
      "NuclearPolicy\n",
      "EducationPolicy\n",
      "PublicPolicyAddressingHomelessness\n",
      "RenewableEnergyPolicy\n",
      "TradePolicy\n",
      "EconomicPolicy\n",
      "SpacePolicy\n",
      "IndustrialPolicy\n",
      "MacroeconomicPolicy\n",
      "MonetaryPolicy\n",
      "EnvironmentalPolicy\n"
     ]
    }
   ],
   "source": [
    "# Question: What are included in Public Policies?\n",
    "\n",
    "# Set the SPARQL query\n",
    "sparql_ss.setQuery(\"\"\"\n",
    "    PREFIX kko: <http://kbpedia.org/kko/rc/>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    \n",
    "    SELECT ?publicpolicies\n",
    "    WHERE {\n",
    "      ?publicpolicies rdfs:subClassOf kko:PublicPolicy\n",
    "    }\n",
    "\"\"\")\n",
    "\n",
    "# Specify the format of the results (JSON in this case)\n",
    "sparql_ss.setReturnFormat(JSON)\n",
    "\n",
    "# Execute the query and get the results\n",
    "results = sparql_ss.query().convert()\n",
    "\n",
    "# Print the results\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    publicpolicy = result[\"publicpolicies\"][\"value\"]\n",
    "    print(publicpolicy[26:])"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
